<template>
  <div class="contactPage-wrapper">
    <div class="container-axas">
      <div class="contactPage">
        <div class="contactPage-left">
          <h2 class="gradient-text">Контакты</h2>
          <div class="contactPage-left-buttons">
            <PresentBtn />
            <CallBtn />
          </div>
        </div>
        <div class="contactPage-right">
          <div class="contactPage-right-wrapper">
            <div class="contactPage-right-block">
              <h6>Найдите нас по адрессу</h6>
              <a target="_blank" href="https://goo.gl/maps/G1HhpAF7uvyVz2Ck7"
                >г.Краснодар, ул. Монтажников 1/4, 12 эт., оф. 1205</a
              >
            </div>
            <div class="contactPage-right-buttom">
              <div class="contactPage-right-block">
                <h6>Позвоните нам:</h6>
                <a href="tel:89184167161">+7(918)416-71-61</a>
              </div>
              <div class="contactPage-sochial">
                <a target="_blank" href="https://www.instagram.com/axas.ru/" class="contactPage-sochial-item">
                  <svg
                    width="26"
                    height="26"
                    viewBox="0 0 26 26"
                    fill="none"
                    xmlns="http://www.w3.org/2000/svg"
                  >
                    <path
                      d="M18.962 0H7.03795C3.15716 0 0 3.15716 0 7.03795V18.9622C0 22.8428 3.15716 26 7.03795 26H18.9622C22.8428 26 26 22.8428 26 18.9622V7.03795C26 3.15716 22.8428 0 18.962 0V0ZM24.4757 18.9622C24.4757 22.0023 22.0023 24.4757 18.962 24.4757H7.03795C3.99763 24.4757 1.52423 22.0023 1.52423 18.9622V7.03795C1.52423 3.99763 3.99763 1.52423 7.03795 1.52423H18.9622C22.0023 1.52423 24.4757 3.99763 24.4757 7.03795V18.9622Z"
                      fill="black"
                    />
                    <path
                      d="M12.9998 5.89062C9.07972 5.89062 5.89062 9.07972 5.89062 12.9998C5.89062 16.9199 9.07972 20.109 12.9998 20.109C16.9199 20.109 20.1089 16.9199 20.1089 12.9998C20.1089 9.07972 16.9199 5.89062 12.9998 5.89062ZM12.9998 18.5847C9.92039 18.5847 7.41485 16.0794 7.41485 12.9998C7.41485 9.92039 9.92039 7.41485 12.9998 7.41485C16.0794 7.41485 18.5847 9.92039 18.5847 12.9998C18.5847 16.0794 16.0794 18.5847 12.9998 18.5847Z"
                      fill="black"
                    />
                    <path
                      d="M20.2789 3.36621C19.1205 3.36621 18.1782 4.30864 18.1782 5.46688C18.1782 6.62533 19.1205 7.56776 20.2789 7.56776C21.4373 7.56776 22.3798 6.62533 22.3798 5.46688C22.3798 4.30844 21.4373 3.36621 20.2789 3.36621ZM20.2789 6.04333C19.9611 6.04333 19.7025 5.78466 19.7025 5.46688C19.7025 5.14891 19.9611 4.89044 20.2789 4.89044C20.5969 4.89044 20.8555 5.14891 20.8555 5.46688C20.8555 5.78466 20.5969 6.04333 20.2789 6.04333Z"
                      fill="black"
                    />
                  </svg>
                </a>
                <a target="_blank" href="https://www.facebook.com/iAXAS" class="contactPage-sochial-item">
                  <svg
                    width="32"
                    height="32"
                    viewBox="0 0 32 32"
                    fill="none"
                    xmlns="http://www.w3.org/2000/svg"
                  >
                    <g clip-path="url(#clip0)">
                      <path
                        d="M18.1606 31.9375H13.0261C12.1685 31.9375 11.4708 31.2412 11.4708 30.3853V18.8267H8.47521C7.61757 18.8267 6.91992 18.1301 6.91992 17.2744V12.3215C6.91992 11.4656 7.61757 10.7693 8.47521 10.7693H11.4708V8.28906C11.4708 5.82983 12.2445 3.73755 13.7081 2.23877C15.1782 0.733154 17.2328 -0.0625 19.6496 -0.0625L23.5655 -0.0561524C24.4216 -0.0546875 25.1181 0.641602 25.1181 1.49609V6.09473C25.1181 6.95068 24.4207 7.64697 23.5633 7.64697L20.9268 7.64795C20.1227 7.64795 19.918 7.80884 19.8742 7.85816C19.802 7.93994 19.7162 8.17114 19.7162 8.80957V10.769H23.3651C23.6398 10.769 23.906 10.8367 24.1347 10.9641C24.6281 11.2393 24.9348 11.7595 24.9348 12.3218L24.9329 17.2747C24.9329 18.1301 24.2352 18.8264 23.3776 18.8264H19.7162V30.3853C19.7162 31.2412 19.0183 31.9375 18.1606 31.9375ZM13.3505 30.0615H17.8363V17.9868C17.8363 17.4153 18.3023 16.9504 18.8747 16.9504H23.0532L23.055 12.6453H18.8744C18.302 12.6453 17.8363 12.1804 17.8363 11.6089V8.80957C17.8363 8.07666 17.9109 7.24317 18.4652 6.6167C19.1349 5.85938 20.1905 5.77197 20.9263 5.77197L23.2384 5.771V1.81934L19.6482 1.81348C15.7641 1.81348 13.3505 4.29492 13.3505 8.28906V11.6089C13.3505 12.1802 12.8847 12.6453 12.3123 12.6453H8.79957V16.9504H12.3123C12.8847 16.9504 13.3505 17.4153 13.3505 17.9868V30.0615ZM23.5618 1.81982H23.562H23.5618Z"
                        fill="black"
                      />
                    </g>
                    <defs>
                      <clipPath id="clip0">
                        <rect width="32" height="32" fill="white" />
                      </clipPath>
                    </defs>
                  </svg>
                </a>
              </div>
            </div>
          </div>
        </div>
      </div>
    </div>
    <div class="contactPage-footer">
      <div class="container-axas">
        <div class="contactPage-footer-content">
          <div class="item">
            <p>©2017-2021 «Аксас». Все права защищены</p>
            <p>ИНН: 233710743508; ОГРНИП: 317237500402141</p>
          </div>
          <div class="item">
            <p>
              Сайт разработан
              <a target="_blank" href="https://sector.business/"
                >Сектор бизнеса</a
              >
            </p>
          </div>
        </div>
      </div>
    </div>
  </div>
</template>

<script>
export default {
  name: "ContactPage",
};
</script>
<style lang="scss" scoped></style>
